Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector Methods
The ModelObjectSelector type exposes the following members.
Methods
Name | Description
GetAllObjects
 Returns an enumerator of all the model objects in the current model.
GetAllObjectsWithType(Type[])
 Returns an enumerator of all the model objects in the current model with the given base type.
GetAllObjectsWithType(ModelObject.ModelObjectEnum)
 Returns an enumerator of all the model objects in the current model with the given type.
GetEnumerator
 Returns an enumerator of all the model objects in the current model.
GetFilteredObjectsWithType
 Returns an enumerator of the model objects in the current model with the given type and selected by the filter.
GetObjectsByBoundingBox
 Returns an enumerator of the model objects in the current model colliding with the given geometrical bounding box. Note that this method uses approximate bounding boxes and thus is NOT EXACT, and may return objects not necessarily colliding with the given box but only being somewhere near to it.
GetObjectsByFilter
 Returns an enumerator of the model objects in the current model selected by the given selection filter definition.
GetObjectsByFilterName
 Returns an enumerator of the model objects in the current model selected by the given selection filter.
Top
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model Namespace